RIET/src/Documents/ПроизвольныйЭД/ПроизвольныйЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизвольныйЭД</name>
  <basedOn>Document.ПроизвольныйЭД</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.НаправленияЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПодтверждение</name>
    <comment>Требуется подпись получателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПроизвольныйЭД</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/Enums/НаправленияЭД/НаправленияЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаправленияЭД</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Интеркампани</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/ПроизвольныйЭД/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроизвольныйЭД") Тогда
		Контрагент             = ДанныеЗаполнения.Контрагент;
		Организация            = ДанныеЗаполнения.Организация;
		ТипДокумента           = ДанныеЗаполнения.ТипДокумента;
		ТребуетсяПодтверждение = ДанныеЗаполнения.ТребуетсяПодтверждение;
		Направление            = Перечисления.НаправленияЭД.Исходящий;
		ДокументОснование      = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
